Api_App/app/controllers/appointments_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = ?  [["pet_id", 42]]
---
    def index
        @pet = Pet.find(params[:pet_id])
        @appointments = @pet.appointments.all

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
---
    def show
        @appointment = Appointment.find(params[:id])