Api_App/app/controllers/authentication_controller.rb

    def authenticate
      auth_token = AuthenticateUser.new(auth_params[:name], auth_params[:email], auth_params[:password], auth_params[:role]).call
      user = User.where(email: auth_params[:email])
      json_response(auth_token: auth_token, user_id: user.ids)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "june@example.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (sam@owner.com) LIMIT ?  [["LIMIT", 1]]