Api_App/app/controllers/pets_controller.rb

    def index
        @user = User.find(params[:user_id])
        @pets = @user.pets.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ?  [["user_id", 1]]

    def show
        @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]

    def create
        @user = User.find(params[:user_id])
        @pet = @user.pets.create!(pet_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pets" ("user_id", "name", "pet_type", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Frenchie"], ["pet_type", "Dog"], ["breed", "French_Bulldog"], ["created_at", "2022-11-09 11:28:53.428028"], ["updated_at", "2022-11-09 11:28:53.428028"]]