Api_App/app/auth/authorize_api_request.rb

  def user
      @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]